drop table if exists default.szy_djte_dz_model_user_list_xy_dt;
create table default.szy_djte_dz_model_user_list_xy_dt as 
select aa.uid
      ,bb.xy_a22160001 -- 申请准入分
      ,bb.xy_a22160002 -- 申请准入置信度
      ,bb.xy_a22160003 -- 申请命中机构数
      ,bb.xy_a22160004 -- 申请命中消金类机构数
      ,bb.xy_a22160005 -- 申请命中网络贷款类机构数
      ,bb.xy_a22160006 -- 机构总查询次数
      ,bb.xy_a22160007 -- 最近一次查询时间
      ,bb.xy_a22160008 -- 近1个月机构总查询笔数
      ,bb.xy_a22160009 -- 近3个月机构总查询笔数
      ,bb.xy_a22160010 -- 近6个月机构总查询笔数
      ,cc.xy_c22180001 -- 网贷授信额度
      ,cc.xy_c22180002 -- 网贷额度置信度
      ,cc.xy_c22180003 -- 网络贷款类机构数
      ,cc.xy_c22180004 -- 网络贷款类产品数
      ,cc.xy_c22180005 -- 网络贷款机构最大授信额度
      ,cc.xy_c22180006 -- 网络贷款机构平均授信额度
      ,cc.xy_c22180007 -- 消金建议授信额度
      ,cc.xy_c22180008 -- 消金额度置信度
      ,cc.xy_c22180009 -- 消金贷款类机构数
      ,cc.xy_c22180010 -- 消金贷款类产品数
      ,cc.xy_c22180011 -- 消金贷款类机构最大授信额度
      ,cc.xy_c22180012 -- 消金贷款类机构平均授信额度
      ,dd.xy_b22170002 -- 近1个月贷款笔数
      ,dd.xy_b22170003 -- 近3个月贷款笔数
      ,dd.xy_b22170004 -- 近6个月贷款笔数
      ,dd.xy_b22170005 -- 近12个月贷款笔数
      ,dd.xy_b22170006 -- 近24个月贷款笔数
      ,dd.xy_b22170007 -- 近1个月贷款总金额
      ,dd.xy_b22170008 -- 近3个月贷款总金额
      ,dd.xy_b22170009 -- 近6个月贷款总金额
      ,dd.xy_b22170010 -- 近12个月贷款总金额
      ,dd.xy_b22170011 -- 近24个月贷款总金额
      ,dd.xy_b22170012 -- 近12个月贷款金额在1k及以下的笔数
      ,dd.xy_b22170013 -- 近12个月贷款金额在1k-3k的笔数
      ,dd.xy_b22170014 -- 近12个月贷款金额在3k-10k的笔数
      ,dd.xy_b22170015 -- 近12个月贷款金额在1w以上的笔数
      ,dd.xy_b22170016 -- 近1个月贷款机构数
      ,dd.xy_b22170017 -- 近3个月贷款机构数
      ,dd.xy_b22170018 -- 近6个月贷款机构数
      ,dd.xy_b22170019 -- 近12个月贷款机构数
      ,dd.xy_b22170020 -- 近24个月贷款机构数
      ,dd.xy_b22170021 -- 近12个月消金类贷款机构数
      ,dd.xy_b22170022 -- 近24个月消金类贷款机构数
      ,dd.xy_b22170023 -- 近12个月网贷类贷款机构数
      ,dd.xy_b22170024 -- 近24个月网贷类贷款机构数
      ,dd.xy_b22170025 -- 近6个月M0+逾期贷款笔数
      ,dd.xy_b22170026 -- 近12个月M0+逾期贷款笔数
      ,dd.xy_b22170027 -- 近24个月M0+逾期贷款笔数
      ,dd.xy_b22170028 -- 近6个月M1+逾期贷款笔数
      ,dd.xy_b22170029 -- 近12个月M1+逾期贷款笔数
      ,dd.xy_b22170030 -- 近24个月M1+逾期贷款笔数
      ,dd.xy_b22170031 -- 近6个月累计逾期金额
      ,dd.xy_b22170032 -- 近12个月累计逾期金额
      ,dd.xy_b22170033 -- 近24个月累计逾期金额
      ,dd.xy_b22170034 -- 正常还款订单数占贷款总订单数比例
      ,dd.xy_b22170035 -- 近1个月失败扣款笔数
      ,dd.xy_b22170036 -- 近3个月失败扣款笔数
      ,dd.xy_b22170037 -- 近6个月失败扣款笔数
      ,dd.xy_b22170038 -- 近12个月失败扣款笔数
      ,dd.xy_b22170039 -- 近24个月失败扣款笔数
      ,dd.xy_b22170040 -- 近1个月履约贷款总金额
      ,dd.xy_b22170041 -- 近3个月履约贷款总金额
      ,dd.xy_b22170042 -- 近6个月履约贷款总金额
      ,dd.xy_b22170043 -- 近12个月履约贷款总金额
      ,dd.xy_b22170044 -- 近24个月履约贷款总金额
      ,dd.xy_b22170045 -- 近1个月履约贷款次数
      ,dd.xy_b22170046 -- 近3个月履约贷款次数
      ,dd.xy_b22170047 -- 近6个月履约贷款次数
      ,dd.xy_b22170048 -- 近12个月履约贷款次数
      ,dd.xy_b22170049 -- 近24个月履约贷款次数
      ,dd.xy_b22170050 -- 最近一次履约距今天数
      ,dd.xy_b22170051 -- 贷款行为置信度
      ,dd.xy_b22170052 -- 贷款已结清订单数
      ,dd.xy_b22170053 -- 信用贷款时长
      ,dd.xy_b22170054 -- 最近一次贷款放款时间
from default.szy_djte_dz_model_user_list_key as aa 
left join (
    -- 新颜多头全景雷达V2 申请
    select aa.uid
          ,aa.xy_a22160001 -- 申请准入分
          ,aa.xy_a22160002 -- 申请准入置信度
          ,aa.xy_a22160003 -- 申请命中机构数
          ,aa.xy_a22160004 -- 申请命中消金类机构数
          ,aa.xy_a22160005 -- 申请命中网络贷款类机构数
          ,aa.xy_a22160006 -- 机构总查询次数
          ,aa.xy_a22160007 -- 最近一次查询时间
          ,aa.xy_a22160008 -- 近1个月机构总查询笔数
          ,aa.xy_a22160009 -- 近3个月机构总查询笔数
          ,aa.xy_a22160010 -- 近6个月机构总查询笔数
    from (
        select aa.uid
              ,bb.a22160001 as xy_a22160001 -- 申请准入分
              ,bb.a22160002 as xy_a22160002 -- 申请准入置信度
              ,bb.a22160003 as xy_a22160003 -- 申请命中机构数
              ,bb.a22160004 as xy_a22160004 -- 申请命中消金类机构数
              ,bb.a22160005 as xy_a22160005 -- 申请命中网络贷款类机构数
              ,bb.a22160006 as xy_a22160006 -- 机构总查询次数
              ,bb.a22160007 as xy_a22160007 -- 最近一次查询时间
              ,bb.a22160008 as xy_a22160008 -- 近1个月机构总查询笔数
              ,bb.a22160009 as xy_a22160009 -- 近3个月机构总查询笔数
              ,bb.a22160010 as xy_a22160010 -- 近6个月机构总查询笔数
              ,row_number() over (partition by aa.uid order by abs(unix_timestamp(bb.created_at) - unix_timestamp(aa.adt_tim)) asc) as n
        from default.szy_djte_dz_model_user_list_key as aa  
        left join (
            select *
            from ods_loan.ods_loan_s3_creditdata_apply_report_detail_v2
            where day <= '2020-10-22'
              and day >= '2020-08-01'
        ) as bb
        on aa.uid = bb.uid
        where abs(datediff(aa.adt_tim,bb.created_at)) <= 7
    ) as aa 
    where aa.n = 1
) as bb
on aa.uid = bb.uid
left join (
    -- 新颜多头全景雷达V2 贷款
    select aa.uid
          ,aa.xy_c22180001 -- 网贷授信额度
          ,aa.xy_c22180002 -- 网贷额度置信度
          ,aa.xy_c22180003 -- 网络贷款类机构数
          ,aa.xy_c22180004 -- 网络贷款类产品数
          ,aa.xy_c22180005 -- 网络贷款机构最大授信额度
          ,aa.xy_c22180006 -- 网络贷款机构平均授信额度
          ,aa.xy_c22180007 -- 消金建议授信额度
          ,aa.xy_c22180008 -- 消金额度置信度
          ,aa.xy_c22180009 -- 消金贷款类机构数
          ,aa.xy_c22180010 -- 消金贷款类产品数
          ,aa.xy_c22180011 -- 消金贷款类机构最大授信额度
          ,aa.xy_c22180012 -- 消金贷款类机构平均授信额度
    from (
        select aa.uid
              ,bb.c22180001 as xy_c22180001 -- 网贷授信额度
              ,bb.c22180002 as xy_c22180002 -- 网贷额度置信度
              ,bb.c22180003 as xy_c22180003 -- 网络贷款类机构数
              ,bb.c22180004 as xy_c22180004 -- 网络贷款类产品数
              ,bb.c22180005 as xy_c22180005 -- 网络贷款机构最大授信额度
              ,bb.c22180006 as xy_c22180006 -- 网络贷款机构平均授信额度
              ,bb.c22180007 as xy_c22180007 -- 消金建议授信额度
              ,bb.c22180008 as xy_c22180008 -- 消金额度置信度
              ,bb.c22180009 as xy_c22180009 -- 消金贷款类机构数
              ,bb.c22180010 as xy_c22180010 -- 消金贷款类产品数
              ,bb.c22180011 as xy_c22180011 -- 消金贷款类机构最大授信额度
              ,bb.c22180012 as xy_c22180012 -- 消金贷款类机构平均授信额度
              ,row_number() over (partition by aa.uid order by abs(unix_timestamp(bb.created_at) - unix_timestamp(aa.adt_tim)) asc) as n
        from default.szy_djte_dz_model_user_list_key as aa  
        left join (
            select *
            from ods_loan.ods_loan_s3_creditdata_current_report_detail_v2
            where day <= '2020-10-22'
              and day >= '2020-08-01'
        ) as bb
        on aa.uid = bb.uid
        where abs(datediff(aa.adt_tim,bb.created_at)) <= 7
    ) as aa 
    where aa.n = 1
) as cc
on aa.uid = cc.uid
left join (
    -- 新颜多头全景雷达V2 行为
    select aa.uid
          ,aa.xy_b22170002 -- 近1个月贷款笔数
          ,aa.xy_b22170003 -- 近3个月贷款笔数
          ,aa.xy_b22170004 -- 近6个月贷款笔数
          ,aa.xy_b22170005 -- 近12个月贷款笔数
          ,aa.xy_b22170006 -- 近24个月贷款笔数
          ,aa.xy_b22170007 -- 近1个月贷款总金额
          ,aa.xy_b22170008 -- 近3个月贷款总金额
          ,aa.xy_b22170009 -- 近6个月贷款总金额
          ,aa.xy_b22170010 -- 近12个月贷款总金额
          ,aa.xy_b22170011 -- 近24个月贷款总金额
          ,aa.xy_b22170012 -- 近12个月贷款金额在1k及以下的笔数
          ,aa.xy_b22170013 -- 近12个月贷款金额在1k-3k的笔数
          ,aa.xy_b22170014 -- 近12个月贷款金额在3k-10k的笔数
          ,aa.xy_b22170015 -- 近12个月贷款金额在1w以上的笔数
          ,aa.xy_b22170016 -- 近1个月贷款机构数
          ,aa.xy_b22170017 -- 近3个月贷款机构数
          ,aa.xy_b22170018 -- 近6个月贷款机构数
          ,aa.xy_b22170019 -- 近12个月贷款机构数
          ,aa.xy_b22170020 -- 近24个月贷款机构数
          ,aa.xy_b22170021 -- 近12个月消金类贷款机构数
          ,aa.xy_b22170022 -- 近24个月消金类贷款机构数
          ,aa.xy_b22170023 -- 近12个月网贷类贷款机构数
          ,aa.xy_b22170024 -- 近24个月网贷类贷款机构数
          ,aa.xy_b22170025 -- 近6个月M0+逾期贷款笔数
          ,aa.xy_b22170026 -- 近12个月M0+逾期贷款笔数
          ,aa.xy_b22170027 -- 近24个月M0+逾期贷款笔数
          ,aa.xy_b22170028 -- 近6个月M1+逾期贷款笔数
          ,aa.xy_b22170029 -- 近12个月M1+逾期贷款笔数
          ,aa.xy_b22170030 -- 近24个月M1+逾期贷款笔数
          ,aa.xy_b22170031 -- 近6个月累计逾期金额
          ,aa.xy_b22170032 -- 近12个月累计逾期金额
          ,aa.xy_b22170033 -- 近24个月累计逾期金额
          ,aa.xy_b22170034 -- 正常还款订单数占贷款总订单数比例
          ,aa.xy_b22170035 -- 近1个月失败扣款笔数
          ,aa.xy_b22170036 -- 近3个月失败扣款笔数
          ,aa.xy_b22170037 -- 近6个月失败扣款笔数
          ,aa.xy_b22170038 -- 近12个月失败扣款笔数
          ,aa.xy_b22170039 -- 近24个月失败扣款笔数
          ,aa.xy_b22170040 -- 近1个月履约贷款总金额
          ,aa.xy_b22170041 -- 近3个月履约贷款总金额
          ,aa.xy_b22170042 -- 近6个月履约贷款总金额
          ,aa.xy_b22170043 -- 近12个月履约贷款总金额
          ,aa.xy_b22170044 -- 近24个月履约贷款总金额
          ,aa.xy_b22170045 -- 近1个月履约贷款次数
          ,aa.xy_b22170046 -- 近3个月履约贷款次数
          ,aa.xy_b22170047 -- 近6个月履约贷款次数
          ,aa.xy_b22170048 -- 近12个月履约贷款次数
          ,aa.xy_b22170049 -- 近24个月履约贷款次数
          ,aa.xy_b22170050 -- 最近一次履约距今天数
          ,aa.xy_b22170051 -- 贷款行为置信度
          ,aa.xy_b22170052 -- 贷款已结清订单数
          ,aa.xy_b22170053 -- 信用贷款时长
          ,aa.xy_b22170054 -- 最近一次贷款放款时间
    from (
        select aa.uid
              -- ,bb.b22170001 as xy_b22170001 -- 贷款行为分
              ,bb.b22170002 as xy_b22170002 -- 近1个月贷款笔数
              ,bb.b22170003 as xy_b22170003 -- 近3个月贷款笔数
              ,bb.b22170004 as xy_b22170004 -- 近6个月贷款笔数
              ,bb.b22170005 as xy_b22170005 -- 近12个月贷款笔数
              ,bb.b22170006 as xy_b22170006 -- 近24个月贷款笔数
              ,bb.b22170007 as xy_b22170007 -- 近1个月贷款总金额
              ,bb.b22170008 as xy_b22170008 -- 近3个月贷款总金额
              ,bb.b22170009 as xy_b22170009 -- 近6个月贷款总金额
              ,bb.b22170010 as xy_b22170010 -- 近12个月贷款总金额
              ,bb.b22170011 as xy_b22170011 -- 近24个月贷款总金额
              ,bb.b22170012 as xy_b22170012 -- 近12个月贷款金额在1k及以下的笔数
              ,bb.b22170013 as xy_b22170013 -- 近12个月贷款金额在1k-3k的笔数
              ,bb.b22170014 as xy_b22170014 -- 近12个月贷款金额在3k-10k的笔数
              ,bb.b22170015 as xy_b22170015 -- 近12个月贷款金额在1w以上的笔数
              ,bb.b22170016 as xy_b22170016 -- 近1个月贷款机构数
              ,bb.b22170017 as xy_b22170017 -- 近3个月贷款机构数
              ,bb.b22170018 as xy_b22170018 -- 近6个月贷款机构数
              ,bb.b22170019 as xy_b22170019 -- 近12个月贷款机构数
              ,bb.b22170020 as xy_b22170020 -- 近24个月贷款机构数
              ,bb.b22170021 as xy_b22170021 -- 近12个月消金类贷款机构数
              ,bb.b22170022 as xy_b22170022 -- 近24个月消金类贷款机构数
              ,bb.b22170023 as xy_b22170023 -- 近12个月网贷类贷款机构数
              ,bb.b22170024 as xy_b22170024 -- 近24个月网贷类贷款机构数
              ,bb.b22170025 as xy_b22170025 -- 近6个月M0+逾期贷款笔数
              ,bb.b22170026 as xy_b22170026 -- 近12个月M0+逾期贷款笔数
              ,bb.b22170027 as xy_b22170027 -- 近24个月M0+逾期贷款笔数
              ,bb.b22170028 as xy_b22170028 -- 近6个月M1+逾期贷款笔数
              ,bb.b22170029 as xy_b22170029 -- 近12个月M1+逾期贷款笔数
              ,bb.b22170030 as xy_b22170030 -- 近24个月M1+逾期贷款笔数
              ,bb.b22170031 as xy_b22170031 -- 近6个月累计逾期金额
              ,bb.b22170032 as xy_b22170032 -- 近12个月累计逾期金额
              ,bb.b22170033 as xy_b22170033 -- 近24个月累计逾期金额
              ,bb.b22170034 as xy_b22170034 -- 正常还款订单数占贷款总订单数比例
              ,bb.b22170035 as xy_b22170035 -- 近1个月失败扣款笔数
              ,bb.b22170036 as xy_b22170036 -- 近3个月失败扣款笔数
              ,bb.b22170037 as xy_b22170037 -- 近6个月失败扣款笔数
              ,bb.b22170038 as xy_b22170038 -- 近12个月失败扣款笔数
              ,bb.b22170039 as xy_b22170039 -- 近24个月失败扣款笔数
              ,bb.b22170040 as xy_b22170040 -- 近1个月履约贷款总金额
              ,bb.b22170041 as xy_b22170041 -- 近3个月履约贷款总金额
              ,bb.b22170042 as xy_b22170042 -- 近6个月履约贷款总金额
              ,bb.b22170043 as xy_b22170043 -- 近12个月履约贷款总金额
              ,bb.b22170044 as xy_b22170044 -- 近24个月履约贷款总金额
              ,bb.b22170045 as xy_b22170045 -- 近1个月履约贷款次数
              ,bb.b22170046 as xy_b22170046 -- 近3个月履约贷款次数
              ,bb.b22170047 as xy_b22170047 -- 近6个月履约贷款次数
              ,bb.b22170048 as xy_b22170048 -- 近12个月履约贷款次数
              ,bb.b22170049 as xy_b22170049 -- 近24个月履约贷款次数
              ,bb.b22170050 as xy_b22170050 -- 最近一次履约距今天数
              ,bb.b22170051 as xy_b22170051 -- 贷款行为置信度
              ,bb.b22170052 as xy_b22170052 -- 贷款已结清订单数
              ,bb.b22170053 as xy_b22170053 -- 信用贷款时长
              ,bb.b22170054 as xy_b22170054 -- 最近一次贷款放款时间
              ,row_number() over (partition by aa.uid order by abs(unix_timestamp(bb.created_at) - unix_timestamp(aa.adt_tim)) asc) as n
        from default.szy_djte_dz_model_user_list_key as aa  
        left join (
            select *
            from ods_loan.ods_loan_s3_creditdata_behavior_report_detail_v2
            where day <= '2020-10-22'
              and day >= '2020-08-01'
        ) as bb
        on aa.uid = bb.uid
        where abs(datediff(aa.adt_tim,bb.created_at)) <= 7
    ) as aa 
    where aa.n = 1
) as dd
on aa.uid = dd.uid